<?php


function out_my_preface()
{
  return <<<HTML
<p>С детства я считал, что это вполне обычное дело, когда твой дед пишет стихи. Я видел исписанные листочки бумаги и записные книжки на тумбочках, слышал эти строки вечерами, когда семья собиралась на какой-нибудь праздник, всегда считая это нужным и важным.</p>
<p>До пятнадцати лет, каждое лето, когда мои родители были заняты работой, я проводил время на даче вместе со своим дедом и бабушкой, среди яблонь, грядок клубники, книжек и всяческих насекомых. Дед был одним из моих воспитателей, человеком с обостренным чувством справедливости, убежденным коммунистом, который в 18 лет отправился защищать Родину.</p>
<p>И когда внук, как многие дети, просил рассказать о войне, рассчитывая услышать какие-то приключенческие истории, как в кино, о героизме и боевой романтике, дед отвечал нет. Нет ничего такого на войне. Есть только грязный и страшный быт, который ёмко передан двумя строчками стихотворения Семёна Гудзенко<sup><a href="#cite1">[*]</a></sup>.</p>
<p>Именно военное время, как мне сейчас видится, сформировало личность молодого Леонида Павлова. Фронтовые товарищи стали друзьями на всю жизнь. Страшные сражения стали наиболее яркими событиями жизни, точкой отсчета и мерилом добра и зла. Черно-белая логика войны сформировала непримиримое отношение к другим точкам зрения, в котором любые компромиссы – это слабость и предательство. Такой моральный абсолютизм и дает поэзии то, что мы в ней ценим: романтику и идеализм.</p>
<p id="cite1" class="right_aligned">* «Перед атакой», 1942, <a target=”_blank” href="https://youtu.be/MHbKORodayE?t=456">две</a> последние строки</p>
HTML;
}


function out_editorial_preface()
{
  return <<<HTML
<h1 class="margin_bottom_1em">Биография</h1>
<p>Леонид Семенович Павлов родился в 1923 г. в г. Череповце. В 1940 г. закончил среднюю школу и поступил в Военно-инженерное училище. С началом войны вступил в ряды Красной Армии. С января 1942 г. до конца блокады воевал на Ленинградском фронте. Служил командиром взвода в инженерных войсках, заместителем командира роты и начальником штаба стрелкового батальона в общевойсковых соединениях. В ноябре 1942 г. на Ленинградском фронте вступил в ряды партии.</p>
<p>Леонид Семенович участвовал в боях под Красным Бором, Невской Дубровкой по прорыву и снятию блокады в 55-й и 67-й Армиях. Воевал в 44-й стрелковой дивизии, с июля 1944 года 1-й помощник начальника штаба 25-го стрелкового Островского батальона. Был дважды ранен. В начале января 1945 г. получил тяжелое ранение и восемь месяцев пролежал в госпитале. В результате ранения стал инвалидом 2-й группы.</p>
<p>После войны учился в Ленинградской областной партшколе, затем работал первым секретарем райкома ВЛКСМ. Много лет был секретарем партийной организации фабрики, работал заместителем директора по кадрам, затем директором Всеволожской трикотажной фабрики. Неоднократно избирался членом райкома КПСС, депутатом местных Советов.</p>
<p class="right_aligned">из издания АОЗТ РАНЕТ</p>
HTML;
}
